{
  "searchCriteria" : {},
  "metadata" :  {
    "totalItems" : 54
  },
  "products" : [{
      "id" : 1,
      "title" : "An introduction to modal logic",
      "author" : "Hughes and Cresswell",
      "image" : "modal-logic.jpg",
      "description" : ""
    },{
      "id" :  2,
      "title" : "Why nations fail",
      "author" : "Acemoglu and Robinson",
      "image" : "why-nations-fail.jpg",
      "description" : "Why are some nations more prosperous than others? Why Nations Fail sets out to answer this question, with a compelling and elegantly argued new theory: that it is not down to climate, geography or culture, but because of institutions. Drawing on an extraordinary range of contemporary and historical examples, from ancient Rome through the Tudors to modern-day China, leading academics Daron Acemoglu and James A."
    },{
      "id" : 3,
      "title" : "Five Dialogues: Euthyphro, Apology, Crito, Meno, Phaedo",
      "author" : "Plato",
      "image" : "plato.jpg",
      "description" : "The second edition of Five Dialogues presents G. M. A. Grube's distinguished translations, as revised by John Cooper for Plato, Complete Works . A number of new or expanded footnotes are also included along with an updated bibliography."
    },
    {
      "id" : 4,
      "title" : "Counterpath",
      "author" : "Catherine Malabou and Jacques Derrida" ,
      "image" : "counterpath.jpg",
      "description" : "Counterpath is a collaborative work by Catherine Malabou and Jacques Derrida that answers to the gamble inherent in the idea of \"travelling with\" the philosopher of deconstruction. Malabou's readerly text of quotations and commentary demonstrates how Derrida's work, while appearing to be anything but a travelogue, is nevertheless replete with references to geographical and topographical locations, and functions as a kind of counter-Odyssey through meaning, theorizing, and thematizing notions of arrival, drifting, derivation, and catastrophe."
    },
    {
      "id" : 5,
      "title" : "The essence of human-computer interaction",
      "author" : "Christine Faulkner",
      "image" : "human-computer-interaction.jpg",
      "description" : "The Prentice Hall Essence of Computer Science Series provides a concise, practical and uniform introduction to the core components of an undergraduate Computer Science degree. Acknowledging recent changes within higher education, this approach uses a variety of pedagogical tools - case-studies, worked examples and self-test questions - to underpin the student's learning."
    },
    {
      "id" : 6,
      "title" : "The rise of the Dutch Republic",
      "author" : "John Motley" ,
      "image" : "rise-of-dutch-republic.jpg",
      "description" : "John Lothrop Motley was a 19th century American diplomat and writer who wrote at length about historical topics and reviews of others' writings, from the Civil War era to reviews of Honore de Balzac's fiction."
    },
    {
      "id" : 7,
      "title" : "Mediaeval Europe: A Textbook of European History, 1095-1254",
      "author" : "Kenneth Bell",
      "image" : "mediaeval-europe.jpg",
      "description" : "The strength of the baronage came from their hold on the land. The whole of early mediaeval society was based on the land, from which it was fed. The peasants tilled it as the serfs of the lord of their village. That lord had himself become the vassal of some greater man, who might himself be the vassal of the King. Each vassal was bound to his lord by the necessity of doing service either on the field of battle or on the land. The only man who had no subject was the serf. The one man who had no lord was the King, or, more strictly speaking, the Emperor."
    },
    {
      "id" : 8,
      "title" : "The Age of Enlightenment",
      "author" : "Isaiah Berlin",
      "image" : "age-of-enlightenment.jpg",
      "description" : ""
    },
    {
      "id" : 9,
      "title" : "Confessions",
      "author" : "Saint Augustine",
      "image" : "st-augustine.jpg",
      "description" : ""
    },
    {
      "id" : 10,
      "title" : "Javascript Patterns",
      "author" : "Stoyan Stefanov" ,
      "image" : "javascript-patterns.jpg",
      "description" : ""
    },
    {
      "id" : 11,
      "title" : "Seven Languages in Seven Weeks",
      "author" : "Bruce Tate",
      "image" : "seven-languages.jpg",
      "description" : ""
    },
    {
      "id" : 12,
      "title" : "The History of Greek Vases",
      "author" : "John Boardman" ,
      "image" : "greek-vases.jpg",
      "description" : ""
    },
    {
      "id" : 13,
      "title" : "Clean Code",
      "author" : "Robert C. Martin" ,
      "image" : "clean-code.jpg",
      "description" : ""
    },
    {
      "id" : 14,
      "title" : "Version Control with Git",
      "author" : "Jon Loeliger",
      "image" : "git.jpg",
      "description" : ""
    },
    {
      "id" : 15,
      "title" : "Politics",
      "author" : "Aristotle",
      "image" : "politics.jpg",
      "description" : "" },
    {
      "id" : 16,
      "title" : "The Greek Philosophers",
      "author" : "Rex Warner",
      "image" : "philosophers.jpg",
      "description" : "" },
    {
      "id" : 17,
      "title" : "Semiotics",
      "author" : "Daniel Chandler",
      "image" : "semiotics.jpg",
      "description" : "" },
    {
      "id" : 18,
      "title" : "The Mobile Handbook",
      "author" : "Peter-Paul Koch",
      "image" : "mobile-handbook.jpg",
      "description" : ""
    },
    {
      "id" : 19,
      "title" : "ASP.NET Core and Angular 2",
      "author" : "Valerio De Sanctis",
      "image" : "angular-dot-net.jpg",
      "description" : "" },
    {
      "id" : 20,
      "title" : "ng-book-2 The complete book on Angular 2",
      "author" : "Nate Murray and Ari Lerner",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 21,
      "title" : "Learning Angular 2",
      "author" : "Pablo Deeleman",
      "image" : "learning-angular.jpg",
      "description" : ""
    },
    {
      "id" : 22,
      "title" : "Mobile App Development with Ionic 2: Cross-Platform Apps with Ionic 2, Angular 2, and Cordova",
      "author" : "Chris Griffin",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 23,
      "title" : "SurviveJS - Webpack and React: From apprentice to master",
      "author" : "Juho Vepsäläinen",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 24,
      "title" : "Building Microservices",
      "author" : "Sam Newman",
      "image" : "building-microservices.jpg",
      "description" : "Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures."

    },
    {
      "id" : 25,
      "title" : "CSS Master",
      "author" : "Tiffany B. Brown",
      "image" : "css-mastery.jpg",
      "description" : ""
    },
    {
      "id" : 26,
      "title" : "Logical Chess: Move by Move: Every Move Explained ",
      "author" : "Irving Chernev",
      "image" : "logical-chess.jpg",
      "description" : ""
    },
    {
      "id" : 27,
      "title" : "Unraveling Angular 2: The Ultimate Beginners Guide with over 130 Complete Samples: Volume 8 ",
      "author" : "Istvan Novak",
      "image" : "unraveling-angular-2.jpg",
      "description" : ""
    },
    {
      "id" : 28,
      "title" : "Developing Backbone.js Applications",
      "author" : "Addy Osmani",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 29,
      "title" : "Design Patterns",
      "author" : "Gamma, Helm, Johnson, & Vlissides",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 30,
      "title" : "Backbone.js Patterns and Best Practices",
      "author" : "Swarnendu Du",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 31,
      "title" : "Developing Web Components: UI from jQuery to Polymer",
      "author" : "Jarrod Overson",
      "image" : "web-components",
      "description" : "Although web components are still on the bleeding edge—barely supported in modern browsers—the technology is also moving extremely fast. This practical guide gets you up to speed on the concepts underlying W3C’s emerging standard and shows you how to build custom, reusable HTML5 Web Components."
    },
    {
      "id" : 32,
      "title" : "Hypatia of Alexandria: Mathematician and Martyr",
      "author" : "Michael Deakin",
      "image" : "",
      "description" : ""
    },
    {
      "id" : 33,
      "title" : "Exploring History in the Scottish Borders",
      "author" : "Ian James Douglas",
      "image" : "scottish-borders.jpg",
      "description" : "The Scottish border is steeped in history. “Exploring History in the Scottish Borders” provides an overview of the history of this turbulent area. This didn't produce Robin Hood characters, it produced a tough and often violent people, the border reivers. In the 16th century the Scottish borderland made the American wild west of the 19th century look like a kindergarten. But its past has also left its mark in splendid castles, beautiful ruined abbeys, and a depth of history few other areas can match. "
    },
    {
      "id" : 34,
      "title" : "From Puritanism to Postmodernism: A History of American Literature",
      "author" : "Malcolm Bradbury",
      "image" : "",
      "description" : "From a Modernist/Postmodernist perspective, this addresses questions of literary and cultural nationalism. The authors reveal that since the seventeenth century, American writing has reflected the political and historical climate of its time and helped define America's cultural and social parameters.Aboe all they argue that American literature has always been essentially \"modern\", illustrating this with a broad range of texts: from Poe and Melville to fitzgerald and Proud, to Wallace and Stevens, Gwendolyn Brooks, and Thomas Pynchon."
    },
    {
      "id" : 35,
      "title" : "HTML5 Pocket Reference",
      "author" : "Jennifer Niederst Robbins",
      "image" : "html5.jpg",
      "description" : "Jennifer Niederst Robbins was one of the first designers for the Web. As the designer of O'Reilly's Global Network Navigator (GNN), the first commercial web site, she has been designing for the Web since 1993. She is the author of the bestselling \"Web Design in a Nutshell\" (O'Reilly), and has taught web design at the Massachusetts College of Art in Boston and Johnson and Wales University in Providence. She has spoken at major design and Internet events including SXSW Interactive, Seybold Seminars, the GRAFILL conference (Geilo, Norway), and one of the first W3C International Expos."
    },
    {
      "id" : 36,
      "title" : "CSS Pocket Reference",
      "author" : "Eric A. Meyer" ,
      "image" : "css-pocket.jpg",
      "description" : "Eric A. Meyer starting working on the web in late 1993. A past member of the CSS Working Group, he is the author of several acclaimed CSS books as well as many articles on CSS and web standards. More recently, he co-founded the conference series An Event Apart with Jeffrey Zeldman and speaks about web standards all over the world. In recognition of his work, he was inducted into the International Academy of Digital Arts and Sciences in 2006."
    },

    {
      "id" : 37,
      "title" : "SurviveJS - Webpack and React: From apprentice to master",
      "author" : "Juho Vepsäläinen",
      "image" : "webpack-and-react.jpg",
      "description" : "Facebook's React powers an increasing amount of sites. There is a good reason for this. It simplifies frontend development greatly. Combined with Webpack, a bundling tool, you have a powerful frontend development environment in your hands.      SurviveJS - Webpack and React shows you how to build a simple Kanban application based on these technologies. During the process you will learn to:Set up a Webpack based development and production environment. You will learn to get most out of babel-plugin-hot-transform and Babel for development."
    },
    {
      "id" : 38,
      "title" : "Effective JavaScript: 68 Specific Ways to Harness the Power of JavaScript (Effective Software Development)",
      "author" : "David Herman",
      "image" : "herman.jpg",
      "description" : "Author David Herman, with his years of experience on Ecma’s JavaScript standardization committee, illuminates the language’s inner workings as never before—helping you take full advantage of JavaScript’s expressiveness. Reflecting the latest versions of the JavaScript standard, the book offers well-proven techniques and best practices you’ll rely on for years to come."
    },
    {
      "id" : 39,
      "title" : "Full Stack JavaScript Development With MEAN",
      "author" : "Colin J Ihrig",
      "image" : "mean-development",
      "description" : "This book explores the MEAN stack in detail. We will begin by covering Node.js, as it will lay the groundwork for all of our server-side work. You will learn how to get Node running on your local machine as well as download modules using npm. The key aspects of the Node.js programming model will also be covered."
    },
    {
      "id" : 40,
      "title" : "Full-Stack JavaScript Development: Develop, Test and Deploy with MongoDB, Express, Angular and Node on AWS",
      "author" : "Eric Bush",
      "image" : "full-stack-js-with-aws.jpg",
      "description" : "Build Full-Stack applications with simple to use, yet powerful JavaScript technologies and host everything in the cloud in an economic and agile way. This book contains an all-encompassing presentation of theory, reference and implementation for building three tier architectures - Data Layer (MongoDB), Service Layer (Express/Node.js) and Presentation Layer (Angular). Learn how to architect, develop, test, secure, deploy and manage a RESTful Web Service. In-depth coverage of NPM modules like express, async, joi, helmet, jwt-simple, supertest, mongodb and more. Utilize Mocha, Fiddler and Selenium."
    },
    {
      "id" : 41,
      "title" : "ppk on JavaScript (Voices That Matter)",
      "author" : "Peter Paul Koch",
      "image" : "ppk-javascript.jpg",
      "description" : "Whether you're an old-school scripter who needs to modernize your JavaScripting skills or a standards-aware Web developer who needs best practices and code examples, you'll welcome this guide from a JavaScript master.Other JavaScript books use example scripts that have little bearing on real-world Web development and are useful only in the chapter at hand. In contrast, Peter-Paul Koch's book uses eight real-world scripts he created for real-world clients in order to earn real-world money."
    },
    {
      "id" : 42,
      "title" : "TypeScript: Modern JavaScript Development",
      "author" : "Remo H. Jansen",
      "image" : "typescript.jpg",
      "description" : "TypeScript is an open source and cross-platform typed superset of JavaScript that compiles to plain JavaScript that runs in any browser or any host. TypeScript adds optional static types, classes, and modules to JavaScript, to enable great tooling and better structuring of large JavaScript applications. Through this three-module learning path, you'll learn the ins-and-outs of TypeScript for building more robust software."
    },
    {
      "id" : 43,
      "title" : "Mobile JavaScript Application Development: Bringing Web Programming to Mobile Devices",
      "author" : "Adrian Kosmaczewski ",
      "image" : "mobile-js-dev.jpg",
      "description" : "When developing apps for the latest smartphones, you’re faced with several vexing questions. How many platforms do you need to accommodate? What level of support do mobile browsers provide? To help you address these and many other key issues, this guide provides a hands-on tour of the most powerful JavaScript frameworks available today.You’ll build sample apps with jQuery Mobile, Sencha Touch, and PhoneGap to learn the unique advantages—and disadvantages—of each framework. From there, you can determine which one is best for your project. This book is ideal for web developers familiar with JavaScript, HTML, and CSS."
    },
    {
      "id" : 44,
      "title" : "Beethoven: The Man and the Artist, as Revealed in His Own Words",
      "author" : "Beethoven",
      "image" : "beethoven.jpg",
      "description" : "This long-esteemed book offers the reader a highly interesting glimpse of Beethoven, the man. There are a number of biographical studies of Beethoven, but nowhere else will you find such a convenient classified collection of his utterances and opinions. Through his own words emerges an image of a man, torn by personal problems and a tragic affliction, yet impelled by a keen sense of his destiny and place in the history of music.Included are over 300 of Beethoven's reflections on the art of composing: \"The startling effects which many credit to the natural genius of the composer, are often achieved with the greatest ease by the use and resolution of the diminished seventh chords"
    },
    {
      "id" : 45,
      "title" : "JavaScript: The Definitive Guide",
      "author" : "David Flanagan",
      "image" : "definitive-guide.jpg",
      "description" : "Since 1996, JavaScript: The Definitive Guide has been the bible for JavaScript programmers—a programmer's guide and comprehensive reference to the core language and to the client-side JavaScript APIs defined by web browsers."
    },
    {
      "id" : 46,
      "title" : "Mastering ArcGIS Server Development with JavaScript",
      "author" : "Ken Doman",
      "image" : "arcgis-js.jpg",
      "description" : "This book is intended for intermediate developers who want to design web mapping applications. You should have some experience with geographic information systems, especially with ArcGIS products such as ArcGIS Server. It also helps to have some experience with HTML, CSS, and JavaScript."
    },
    {
      "id" : 47,
      "title" : "The History of the Decline and Fall of the Roman Empire",
      "author" : "Edward Gibbon",
      "image" : "decline-and-fall.jpg",
      "description" : "Edward Gibbon's six-volume History of the Decline and Fall of the Roman Empire (1776-88) is among the most magnificent and ambitious narratives in European literature. Its subject is the fate of one of the world's greatest civilizations over thirteen centuries - its rulers, wars and society, and the events that led to its disastrous collapse. Here, in volumes one and two, Gibbon charts the vast extent and constitution of the Empire from the reign of Augustus to 395 ad. And in a controversial critique, he examines the early Church, with fascinating accounts of the first Christian and last pagan emperors, Constantine and Julian."
    },
    {
      "id" : 48,
      "title" : "The Silk Roads: A New History of the World",
      "author" : "Peter Frankopan",
      "image" : "silk-roads.jpg",
      "description" : "For centuries, fame and fortune were to be found in the west – in the New World of the Americas. Today, it is the east which calls out to those in search of riches and adventure. Sweeping right across Central Asia and deep into China and India, a region that once took centre stage is again rising to dominate global politics, commerce and culture.A major reassessment of world history, The Silk Roads is a dazzling exploration of the forces that have driven the rise and fall of empires, determined the flow of ideas and goods and are now heralding a new dawn in international affairs."
    },
    {
      "id" : 49,
      "title" : "CSS: The Definitive Guide",
      "author" : "Eric Meyer",
      "image" : "css-def-guide.jpg",
      "description" : "CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more. Author Eric Meyer tackles the subject with passion, exploring in detail each individual CSS property and how it interacts with other properties. You'll not only learn how to avoid common mistakes in interpretation, you also will benefit from the depth and breadth of his experience and his clear and honest style. This is the complete sourcebook on CSS."
    },
    {
      "id" : 50,
      "title" : "CSS and Documents",
      "author" : "Eric Meyer",
      "image" : "css-and-documents.jpg",
      "description" : "Cascading Style Sheets (CSS) is a powerful tool that transforms the presentation of a document or a collection of documents, and it’s spread to nearly every corner of the Web—as well as many non-web environments. In this free introduction to Cascade Style Sheets, you’ll learn how CSS makes it possible for you to completely change the way document elements are presented by a user agent. You’ll discover the origins of this specification and how CSS styles work with HTML.Learn how you can choose style sheets based on the features of a given media type, including desktop screens, web-enabled phones, digital projectors, TVs, Braille devices, print documents, and even various audio renderings of a document. CSS and Documents is an excerpt from the forthcoming 4th edition of CSS: The Definitive Guide."
    },
    {
      "id" : 51,
      "title" : "Sumerians: A History From Beginning to End",
      "author" : "Henry Freeman",
      "image" : "sumerians.jpg",
      "description" : "A legendary civilization vanished under the Fertile Crescent and escaped a fate worse than death until Sumerologists questioned widely accepted truths. The Sumerians reemerged onto the extraordinary timeline of human history. Their tales of kings and gods, including the Epic of Gilgamesh, and their fearless trade in distant lands, during the remarkable Bronze Age, centered in the world’s first city-states that chronicled ancient rivalries and their enduring impact."
    },
    {
      "id" : 52,
      "title" : "Byzantium Triumphant: The Military History of the Byzantines 959-1025",
      "author" : "Julian Romane",
      "image" : "byzantine.jpg",
      "description" : "Byzantium Triumphant describes in detail the wars of the Byzantine emperors Nicephorus II Phocas, his nephew and assassin John I Tzimiskes, and Basil II. The operations, battles and drama of their various bitter struggles unfold, depicting the new energy and improved methods of warfare developed in the late tenth century. These emperors were at war on all fronts, fighting for survival and dominance against enemies including the Arab caliphates, Bulgars (Basil II was dubbed by later authors 'the Bulgar Slayer')"
    },
    {
      "id" : 53,
      "title" : "The Nicomachean Ethics",
      "author" : "Aristotle",
      "image" : "nicomachean-ethics.jpg",
      "description" : "Previously published as Ethics, Aristotle's The Nicomachean Ethics addresses the question of how to live well, and originates the concept of cultivating a virtuous character as the basis of his ethical system. This Penguin Classics edition is translated from the Greek by J.A.K. Thomson with revisions and notes by Hugh Tredennick, and an introduction and bibliography by Jonathan Barnes. 'One swallow does not make a summer; neither does one day. Similarly neither can one day, or a brief space of time, make a man blessed and happy'."
    },
    {
      "id" : 54,
      "title" : "Ethics",
      "author" : "Benedict Spinoza",
      "image" : "spinoza.jpg",
      "description" : "A profoundly beautiful and uniquely insightful description of the universe, Benedict de Spinoza's Ethics is one of the masterpieces of Enlightenment-era philosophy. This Penguin Classics edition is edited and translated from the Latin by Edwin Curley, with an introduction by Stuart Hampshire. Published shortly after his death, the Ethics is undoubtedly Spinoza's greatest work - an elegant, fully cohesive cosmology derived from first principles, providing a coherent picture of reality, and a guide to the meaning of an ethical life."
    },
    {
      "id" : 55,
      "title" : "Discourse on Metaphysics and Other Essays",
      "author" : "Freiherr von Gottfried Wilhelm Leibniz ",
      "image" : "leibniz.jpg",
      "description" : "Discourse on Metaphysics and Other Essays contains complete translations of the two essays that constitute the best introductions to Leibniz's complex thought: Discourse on Metaphysics of 1686 and Monadology of 1714. These are supplemented with two essays of special interest to the student of modern philosophy, On the Ultimate Origination of Things of 1697 and the Preface to his New Essays of 1703-1705."
    },
    {
      "id" : 56,
      "title" : "A Treatise of Human Nature: Being an Attempt to Introduce the Experimental Method of Reasoning into Moral Subjects (Penguin Classics)",
      "author" : "David Hume",
      "image" : "hume.jpg",
      "description" : "One of the most significant works of Western philosophy, Hume's Treatise was published in 1739-40, before he was thirty years old. A pinnacle of English empiricism, it is a comprehensive attempt to apply scientific methods of observation to a study of human nature, and a vigorous attack upon the principles of traditional metaphysical thought. With masterly eloquence"
    },
    {
      "id" : 57,
      "title" : "Critique of Pure Reason",
      "author" : "Immanuel Kant",
      "image" : "kant.jpg",
      "description" : "Kant's Critique of Pure Reason. It presents a profound and challenging investigation into the nature of human reason, its knowledge and illusions. Reason, Kant argues, is the seat of certain concepts that precede experience and make it possible, but we are not therefore entitled to draw conclusions about the natural world from these concepts. The Critique brings together the two opposing schools of philosophy: rationalism"
    },
    {
      "id" : 58,
      "title" : "CSS Mastery",
      "author" : "Andy Budd",
      "image" : "css-mastery.jpg",
      "description" : "Fully updated to the latest CSS modules, make the journey to CSS mastery as simple and painless as possible. This book dives into advanced aspects of CSS-based design, such as responsive design, modular CSS, and CSS typography. Through a series of easy-to-follow tutorials, you will learn practical CSS techniques you can immediately start using in your daily work."
    },
    {
      "id" : 59,
      "title" : "The History of Islamic Political Thought: From the Prophet to the Present",
      "author" : "Antony Black",
      "image" : "islamic-thought.jpg",
      "description" : "A complete history of Islamic political thought from early Islam (c.622-661) to the present. This comprehensive overview describes and interprets all schools of Islamic political thought, their origins, inter-connections and meaning. It examines the Qur'an, the early Caliphate, classical Islamic philosophy, and the political culture of the Ottoman and other empires. Major thinkers such as Averroes (Ibn Rushd)"
    },
    {
      "id" : 60,
      "title" : "The Second World War",
      "author" : "Martin Gilbert",
      "image" : "second-world-war.jpg",
      "description" : "A history of the Second World War that covers all the war fronts, the fighting on land, at sea and in the air, the activities of resistance and partisan groups, espionage, secret intelligence, strategy and tactics, war leaders, generals, admirals and air marshals, individual acts of heroism on all the war fronts and behind the lines, the fate of prisoners of war, the bombing of cities, the submarine war, and the aftermath of the war."
    },
    {
      "id" : 61,
      "title" : "CSS Floating: Floats and Float Shapes",
      "author" : "Eric Meyer",
      "image" : "css-floats.jpg",
      "description" : "While flowing text around images is certainly nothing new, with CSS you can float any element, from images to paragraphs to lists. In this practical guide, author Eric Meyer reveals some interesting-and surprising-ways to use CSS floats in your web design, including the latest capability to flow content past non-rectangular float shapes. Short and sweet, this book is an excerpt from the upcoming fourth edition of CSS:"
    },
    {
      "id" : 62,
      "title" : "The Origins of the Second World War",
      "author" : "A.J.P. Taylor",
      "image" : "origins-of-ww2.jpg",
      "description" : "One of the most popular and controversial historians of the twentieth century, who made his subject accessible to millions, A.J.P. Taylor caused a storm of outrage with this scandalous bestseller. Debunking what were accepted truths about the Second World War, he argued provocatively that Hitler did not set out to cause the war as part of an evil master plan, but blundered into it partly by accident, aided by the shortcomings of others.Fiercely attacked for vindicating Hitler, A.J.P. Taylor's stringent re-examination of the events preceding the Nazi invasion of Poland on 1st September 1939 opened up new debate, and is now recognized as a brilliant and classic piece of scholarly research."
    }
  ]
}